<template>
  <q-page class="agreement">
    <p>
      Настоящая Политика конфиденциальности персональных данных (далее –
      Политика конфиденциальности) действует в отношении всей информации,
      которую Общество с ограниченной ответственностью «НАГ» может получить о
      Пользователе во время использования им сайта общества - NAG.ru,
      расположенного на доменном имени nag.ru, Интернет-магазин «
      Телекоммуникационное оборудование | НАГ», расположенный на доменном имени
      shop.nag.ru, и Форума расположенного на доменном имени forum.nag.ru,
      Конференции российских операторов связи КРОС, расположенной на доменном
      имени cros.nag.ru , а так же программ и продуктов расположенных на этих
      страницах. 1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ 1.1. В настоящей Политике
      конфиденциальности используются следующие термины: 1.1.1. «Администрация
      сайта, форума и Интернет-магазина (далее – Администрация сайта) » –
      уполномоченные сотрудники на управления сайтом, форумом и
      интернет-магазином, действующие от имени ООО «НАГ», которые организуют и
      (или) осуществляет обработку персональных данных, а также определяет цели
      обработки персональных данных, состав персональных данных, подлежащих
      обработке, действия (операции), совершаемые с персональными данными.
      1.1.2. «Персональные данные» - любая информация, относящаяся к прямо или
      косвенно определенному или определяемому физическому лицу (субъекту
      персональных данных). 1.1.3. «Обработка персональных данных» - любое
      действие (операция) или совокупность действий (операций), совершаемых с
      использованием средств автоматизации или без использования таких средств с
      персональными данными, включая сбор, запись, систематизацию, накопление,
      хранение, уточнение (обновление, изменение), извлечение, использование,
      передачу (распространение, предоставление, доступ), обезличивание,
      блокирование, удаление, уничтожение персональных данных. 1.1.4.
      «Конфиденциальность персональных данных» - обязательное для соблюдения
      Администрацией сайта или иным получившим доступ к персональным данным
      лицом требование не допускать их распространения без согласия субъекта
      персональных данных или наличия иного законного основания. 1.1.5.
      «Пользователь сайта, форума или Интернет-магазина (далее ‑ Пользователь)»
      – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее
      Сайт, форум или интернет-магазин. 1.1.6. «Cookies» — небольшой фрагмент
      данных, отправленный веб-сервером и хранимый на компьютере пользователя,
      который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в
      HTTP-запросе при попытке открыть страницу соответствующего сайта. 1.1.7.
      «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети,
      построенной по протоколу IP. 2. ОБЩИЕ ПОЛОЖЕНИЯ 2.1. Использование
      Пользователем сайта, форума или Интернет-магазина означает согласие с
      настоящей Политикой конфиденциальности и условиями обработки персональных
      данных Пользователя. 2.2. В случае несогласия с условиями Политики
      конфиденциальности Пользователь должен прекратить использование сайта,
      форума и Интернет-магазина. 2.3. Настоящая Политика конфиденциальности
      применяется только к сайту, форуму и Интернет-магазину
      «Телекоммуникационное оборудование | НАГ ». Администрация не контролирует
      и не несет ответственность за сайты третьих лиц, на которые Пользователь
      может перейти по ссылкам, доступным на сайте, форуме и Интернет-магазине.
      2.4. Администрация сайта не проверяет достоверность персональных данных,
      предоставляемых Пользователем сайта форума и Интернет-магазина.
    </p>
    <div class="agreement__button p-content">
      <base-button @click="setAgreement">даю согласие</base-button>
    </div>
  </q-page>
</template>

<script>
export default {
  // name: 'PageName',
  methods: {
    setAgreement() {
      localStorage.setItem("agreement", true);
      this.$router.push({ name: "reg_sender" });
    },
  },
};
</script>
<style lang="scss" scoped>
.agreement {
  position: relative;
  &__button {
    bottom: 18px;
    position: fixed;
    left: 0;
    right: 0;
  }
}
</style>
